'''
2  请统计一下，”企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，
低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%； ”
每个字符出现的频率？
'''
def frequency():
    '''Hash '''
    s='''企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，
低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；'''
    d={} # 定义一个字典

    for i in range(len(s)):
        #遍历该字符串
        d[s[i]]=d[s[i]]+1 if s[i] in d.keys() else 1

        # if s[i] in d.keys():
        #     d[s[i]] = d[s[i]] + 1
        # else:
        #     d[s[i]] = 1
    print(d)

if __name__ == '__main__':
    frequency()